import numpy as np

# 1.색인 : 기존 파이썬 문법과 동일

v1 = np.arange(10)
print("1. 원본:", v1) #[0 1 2 3 4 5 6 7 8 9]
print("2. 인덱싱:",v1[0], v1[1]) # 0 1
print("2. 인덱싱:",v1[-1], v1[-2]) # 9 8

print("3. 슬라이싱:",v1[0:4]) # [0 1 2 3]
print("3. 슬라이싱:",v1[:4]) # [0 1 2 3]
print("3. 슬라이싱:",v1[1:]) # [1 2 3 4 5 6 7 8 9]
print("3. 슬라이싱:",v1[:]) # [0 1 2 3 4 5 6 7 8 9]
print("3. 슬라이싱[...]:",v1[...]) # [0 1 2 3 4 5 6 7 8 9]
print("3. 슬라이싱:",v1[1::2]) # [1 3 5 7 9]
print("3. 슬라이싱:",v1[::-1]) # [9 8 7 6 5 4 3 2 1 0]